InformationRegisters/ХарактеристикиОбъектовДляФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ХарактеристикиОбъектовДляФедеральныхМедрегистров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКлассификаторовФедеральныхМедрегистров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УченыеСтепени</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПрофессиональнойПодготовки</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрофессиональныеСтандарты</v8:Type>
						<v8:Type>cfg:EnumRef.СостоянияСотрудника</v8:Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскойОбязанности</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ОтраслиНауки</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляСтатистическогоУчета</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПроцедурАккредитацииСпециалистов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбразованиеФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
						<v8:Type>cfg:CatalogRef.СостояниеВБраке</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Классификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыФедеральныхМедрегистров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/МедицинскиеРегистры1СЕГИСЗ/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Медицина".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ВладелецТикета1СЕГИСЗ() Экспорт
	Возврат "1C-FRMR-MAPPING";
КонецФункции

// НомерКлассификатора может быть "181" или "885".
Функция ИдентификаторыСопоставленийДолжностей(НомерКлассификатора) Экспорт
	ИдентификаторыСопоставлений = Новый Структура;
	ИдентификаторыСопоставлений.Вставить("ЕФС1","1.2.643.5.1.13.13.99.2." + НомерКлассификатора + "_EFC1");	
	ИдентификаторыСопоставлений.Вставить("ОКПДТР","1.2.643.5.1.13.13.99.2." + НомерКлассификатора + "_OKPDTR");	
	ИдентификаторыСопоставлений.Вставить("Синонимы","1.2.643.5.1.13.13.99.2." + НомерКлассификатора + "_syn");	
	Возврат ИдентификаторыСопоставлений;	
КонецФункции

Процедура ОтправитьСопоставления(Организация) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда 
		Возврат;
	КонецЕсли;  
	
	Токен = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
		МодульИнтернетПоддержкаПользователей = ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователей"); 
		ИПППодключена = МодульИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
		Если ИПППодключена Тогда 
			ВладелецТикета = ВладелецТикета1СЕГИСЗ();
			РезультатПолученияТикета = Медицина.ПолучитьТикетИПП(ВладелецТикета);
			Если РезультатПолученияТикета.Тикет <> Неопределено Тогда
				Токен = РезультатПолученияТикета.Тикет;
			Иначе
				ВызватьИсключение РезультатПолученияТикета.Ошибка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Токен) Тогда 
		Возврат;
	КонецЕсли;  

	КодКлассификатора181 = "1.2.643.5.1.13.13.99.2.181";
	КодКлассификатора885 = "1.2.643.5.1.13.13.99.2.885";
	Классификатор181 = Справочники.КлассификаторыФедеральныхМедрегистров.НайтиПоКоду(КодКлассификатора181);
	Классификатор885 = Справочники.КлассификаторыФедеральныхМедрегистров.НайтиПоКоду(КодКлассификатора885); 
	Если Не (ЗначениеЗаполнено(Классификатор181) И ЗначениеЗаполнено(Классификатор885)) Тогда 
		Возврат;
	КонецЕсли;  
		
	Запрос = Новый Запрос;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭлементыКлассификатора181.Код КАК Код181,
			|	Характеристики181.ИсточникЗаполнения КАК Источник181,
			|	ЭлементыКлассификатора885.Код КАК Код885,
			|	Характеристики885.ИсточникЗаполнения КАК Источник885,
			|	ЕСТЬNULL(СвойстваДолжностейГосударственнойСлужбы.КодНаименованияДолжности, """") КАК КодЕФС1,
			|	Должности.Наименование КАК Наименование,
			|	Должности.ОКПДТРКод КАК КодОКПДТР,
			|	Должности.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Должности КАК Должности
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК Характеристики181
			|		ПО (Характеристики181.Объект = Должности.Ссылка)
			|			И (Характеристики181.Классификатор = &Классификатор181)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификатора181
			|		ПО (Характеристики181.Характеристика = ЭлементыКлассификатора181.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК Характеристики885
			|		ПО (Характеристики885.Объект = Должности.Ссылка)
			|			И (Характеристики885.Классификатор = &Классификатор885)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификатора885
			|		ПО (Характеристики885.Характеристика = ЭлементыКлассификатора885.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваДолжностейГосударственнойСлужбы КАК СвойстваДолжностейГосударственнойСлужбы
			|		ПО (СвойстваДолжностейГосударственнойСлужбы.Должность = Должности.Ссылка)
			|ГДЕ
			|	НЕ ЭлементыКлассификатора181.Код ЕСТЬ NULL
			|	И НЕ ЭлементыКлассификатора885.Код ЕСТЬ NULL";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭлементыКлассификатора181.Код КАК Код181,
			|	Характеристики181.ИсточникЗаполнения КАК Источник181,
			|	ЭлементыКлассификатора885.Код КАК Код885,
			|	Характеристики885.ИсточникЗаполнения КАК Источник885,
			|	"""" КАК КодЕФС1,
			|	Должности.Наименование КАК Наименование,
			|	Должности.ОКПДТРКод КАК КодОКПДТР,
			|	Должности.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Должности КАК Должности
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК Характеристики181
			|		ПО (Характеристики181.Объект = Должности.Ссылка)
			|			И (Характеристики181.Классификатор = &Классификатор181)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификатора181
			|		ПО (Характеристики181.Характеристика = ЭлементыКлассификатора181.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК Характеристики885
			|		ПО (Характеристики885.Объект = Должности.Ссылка)
			|			И (Характеристики885.Классификатор = &Классификатор885)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификатора885
			|		ПО (Характеристики885.Характеристика = ЭлементыКлассификатора885.Ссылка)
			|ГДЕ
			|	НЕ ЭлементыКлассификатора181.Код ЕСТЬ NULL
			|	И НЕ ЭлементыКлассификатора885.Код ЕСТЬ NULL";
	КонецЕсли;
	Запрос.УстановитьПараметр("Классификатор181", Классификатор181);
	Запрос.УстановитьПараметр("Классификатор885", Классификатор885);
	РезультатЗапроса = Запрос.Выполнить(); 
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;  
	
	ИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН");
	Версия181 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Классификатор181, "Версия");
	Версия885 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Классификатор885, "Версия");
	Данные = Новый Структура;
	Данные.Вставить("codeSystem", КодКлассификатора181);	
	Данные.Вставить("codeSystemVersion", Версия181);	
	Данные.Вставить("inn", ИНН);	
	Данные.Вставить("list", Новый Массив);	
	Должности = РезультатЗапроса.Выбрать();
	Пока Должности.Следующий() Цикл
		Сопоставление = Новый Структура;
		Сопоставление.Вставить("uuid", Строка(Должности.Ссылка.УникальныйИдентификатор()));
		Сопоставление.Вставить("ID_181", Должности.Код181);
		Сопоставление.Вставить("ID_885", Должности.Код885);
		Сопоставление.Вставить("CODE_OKPDTR", Должности.КодОКПДТР);
		Сопоставление.Вставить("CODE_EFC1", Должности.КодЕФС1);
		Сопоставление.Вставить("position", Должности.Наименование);
		Сопоставление.Вставить("auto_mapped_181", Должности.Источник181);
		Сопоставление.Вставить("auto_mapped_885", Должности.Источник885);
		Данные.list.Добавить(Сопоставление);
	КонецЦикла;

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON, Данные);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	HTTPСоединение = СоздатьСоединение(Истина);
	ОтветСервера = ВыполнитьЗапросВыгрузкиСопоставлений(HTTPСоединение, СтрокаJSON, Токен); 

КонецПроцедуры		

Функция СоздатьСоединение(ДляВыгрузкиСопоставлений = Ложь) Экспорт
	
	ПротоколЗащиты = Новый ЗащищенноеСоединениеOpenSSL;
	Таймаут = 60;
	Если ДляВыгрузкиСопоставлений Тогда 
		Хост = "fnsi.med.1c.ru/frmr";     
	Иначе 
		Хост = "fnsi.med.1c.ru/rest";     
	КонецЕсли;
	ИнтернетПрокси = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
		МодульПолучениеФайловИзИнтернета = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернета");
		ИнтернетПрокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси("https");
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(Хост, , , , ИнтернетПрокси, Таймаут, ПротоколЗащиты);

	Возврат Соединение;
	
КонецФункции

Функция ВыполнитьЗапросОчереднойПорции(HTTPСоединение, ИдентификаторСопоставления, РазмерПорции = 20, Токен = "") Экспорт
	
	ТекстЗапроса = "/data?identifier=" + ИдентификаторСопоставления + "&size=" + РазмерПорции + "&userKey=" + Токен;
	СтруктураОтвета = ВыполнитьЗапросHTTP(HTTPСоединение, ТекстЗапроса);
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ВыполнитьЗапросВыгрузкиСопоставлений(HTTPСоединение, Данные, Токен = "") Экспорт
	
	ТекстЗапроса = "/send?ticket=" + Токен;
	СтруктураОтвета = ВыполнитьЗапросHTTP(HTTPСоединение, ТекстЗапроса, "POST", Данные);
	Возврат СтруктураОтвета;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьЗапросHTTP(HTTPСоединение, АдресРесурса, Метод = "GET", ПолезнаяНагрузка = Неопределено)

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	Если ПолезнаяНагрузка <> Неопределено Тогда 
		ЗапросHTTP.УстановитьТелоИзСтроки(ПолезнаяНагрузка);
    КонецЕсли;

	ОтветHTTP = HTTPСоединение.ВызватьHTTPМетод(Метод, ЗапросHTTP);
	СтруктураОтвета = Новый Структура("КодСостояния,ОтветСервера,ОтветСервераНеРасшифрованный,СообщениеОбОшибке");
	СтруктураОтвета.КодСостояния = ОтветHTTP.КодСостояния;
	
	Если ОтветHTTP.КодСостояния < 400 Тогда 
		ОтветСервера = ОтветHTTP.ПолучитьТелоКакСтроку("UTF-8");
		Если ПустаяСтрока(ОтветСервера) Тогда
			СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Неизвестная ошибка. Код возврата сервиса: '") + ОтветHTTP.КодСостояния;
		Иначе
			Попытка
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ОтветСервера);
				ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
				РезультатЗапроса = ДанныеJSON.Получить("result");
				Если РезультатЗапроса=Неопределено Тогда 
					СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Неверный формат ответа сервиса: '") + ОтветСервера;
				Иначе 
					Если РезультатЗапроса = "ERROR" Тогда 
						СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка сервиса: '") + ОтветСервера;
					Иначе 
						СтруктураОтвета.ОтветСервера = ДанныеJSON;
						СтруктураОтвета.ОтветСервераНеРасшифрованный = ОтветСервера;
					КонецЕсли;
				КонецЕсли;
			Исключение
				Шаблон = НСтр("ru = 'Код возврата сервиса: %1. Ошибка обработки результата: %2'");
				СтруктураОтвета.СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ОтветHTTP.КодСостояния, ОписаниеОшибки());
			КонецПопытки; 
		КонецЕсли;
	ИначеЕсли ОтветHTTP.КодСостояния = 403 Тогда 
		ОтветСервера = ОтветHTTP.ПолучитьТелоКакСтроку("UTF-8");
		Если ПустаяСтрока(ОтветСервера) Тогда
			СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка аутентификации (403 - Доступ запрещен).'");
		Иначе
			Попытка
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ОтветСервера);
				ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
				РезультатЗапроса = ДанныеJSON.Получить("result");
				Если РезультатЗапроса=Неопределено Тогда 
					СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка аутентификации (403 - Доступ запрещен).'");
				Иначе 
					Если РезультатЗапроса = "ERROR" Тогда 
						СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка сервиса: '") + ДанныеJSON.Получить("resultText"); 
					Иначе 
						СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка аутентификации (403 - Доступ запрещен). '") + ОтветСервера;
					КонецЕсли;
				КонецЕсли;
			Исключение
				СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка аутентификации (403 - Доступ запрещен). '") + ОписаниеОшибки();
			КонецПопытки; 
		КонецЕсли;
	ИначеЕсли ОтветHTTP.КодСостояния = 404 Тогда 
		ОтветСервера = ОтветHTTP.ПолучитьТелоКакСтроку("UTF-8");
		Если ПустаяСтрока(ОтветСервера) Тогда
			СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка обращения к методу (404 - Страница не найдена).'");
		Иначе
			Попытка
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ОтветСервера);
				ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
				РезультатЗапроса = ДанныеJSON.Получить("result");
				Если РезультатЗапроса=Неопределено Тогда 
					СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка обращения к методу (404 - Страница не найдена).'");
				Иначе 
					Если РезультатЗапроса = "ERROR" Тогда 
						СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка сервиса: '") + ДанныеJSON.Получить("resultText"); 
					Иначе 
						СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка обращения к методу (404 - Страница не найдена). '") + ОтветСервера;
					КонецЕсли;
				КонецЕсли;
			Исключение
				СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка обращения к методу (404 - Страница не найдена). '") + ОписаниеОшибки();
			КонецПопытки; 
		КонецЕсли;
	Иначе 
		Шаблон = НСтр("ru = 'Ошибка %1.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ОтветHTTP.КодСостояния);
		СтруктураОтвета.СообщениеОбОшибке = ТекстСообщения;
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции


#КонецОбласти
